Fs = 8192;                %采样频率
T = 4;                    %信号持续时间
n = Fs * T;               %采样点总数(4s内)
f1 = 440;                 %y1声音信号频率为440Hz
f2 = 4;                   %y2声音信号频率为4Hz
a = 1;                    %定义指数衰减信号的参数值
t = T*linspace(0,1,n+1);  %信号采样点对应的时域坐标(0-4s内共有t个采样点)
y1 = sin(2*pi*f1*t);      %生成一个频率为440Hz,幅值为1的正弦信号
y2 = sin(2*pi*f2*t);      %生成一个频率为4Hz,幅值为1的正弦信号
y3 = exp(-1*a*t);         %生成一个参数为1的指数衰减信号
figure(1);
subplot(3,2,1);           %准备绘制第1张子图
plot(t,y1);               %绘制信号y1的波形图
subplot(3,2,2);           %准备绘制第2张子图
plot(t,y1);               %绘制信号y1的波形图
subplot(3,2,3);           %准备绘制第3张子图
plot(t,y2);               %绘制信号y2的波形图
subplot(3,2,4);           %准备绘制第4张子图
plot(t,y3);               %绘制信号y3的波形图
subplot(3,2,5);           %准备绘制第5张子图
y_1 = y1 .* y2;           %生成合成信号y_1
plot(t,y_1);              %绘制合成信号y_mix的波形图
subplot(3,2,6);           %准备绘制第6张子图
y_2 = y1 .* y3;           %生成合成信号y_2
plot(t,y_2);              %绘制合成信号y_2的波形图
%sound(y_2,Fs);            %以采样率为8191播放合成声音信号y_2
figure(2);
y_3 = y_1+y_2;            %生成合成信号y_3
plot(t,y_3);              %绘制合成信号y_3的波形图
sound(y_3,Fs);            %以采样率为8191播放合成声音信号y_3